benjaminkravets/KW45B41Z/kw45b41zevk_beacon_bm/component/mem_manager/fsl_component_mem_manager_light.c
                /* new free block is now the tail of the free block list */
                p_area->ctx.FreeBlockHdrList.tail = NextFreeBlockHdr;

#if defined(gMemManagerLightGuardsCheckEnable) && (gMemManagerLightGuardsCheckEnable == 1)
                MEM_BlockHeaderSetGuards(NextFreeBlockHdr);
#endif

                BlockHdrFound = FreeBlockHdr;
            }
#if defined(cMemManagerLightReuseFreeBlocks) && (cMemManagerLightReuseFreeBlocks > 0)
            else if (UsableBlockHdr != NULL)
            {
                /* we found a free block that can be used */
                UsableBlockHdr->used    = MEMMANAGER_BLOCK_USED;
                UsableBlockHdr->area_id = area_id;
#if defined(MEM_STATISTICS_INTERNAL)
                UsableBlockHdr->buff_size = (uint16_t)numBytes;
#endif
                NextFreeBlockHdr = UsableBlockHdr->next_free;
                PrevFreeBlockHdr = UsableBlockHdr->prev_free;

                /* In the current state, the current block header can be anywhere
                   from list head to previous block of list tail */
                if (p_area->ctx.FreeBlockHdrList.head == UsableBlockHdr)
                {
                    p_area->ctx.FreeBlockHdrList.head = NextFreeBlockHdr;
                    NextFreeBlockHdr->prev_free       = NULL;
                }
                else
                {
                    assert(p_area->ctx.FreeBlockHdrList.head->next_free <= UsableBlockHdr);

                    NextFreeBlockHdr->prev_free = PrevFreeBlockHdr;
                    PrevFreeBlockHdr->next_free = NextFreeBlockHdr;
                }
                BlockHdrFound = UsableBlockHdr;
            }
#endif
            else
            {
                BlockHdrFound = NULL;
            }
            break;
        }
#if defined(gMemManagerLightGuardsCheckEnable) && (gMemManagerLightGuardsCheckEnable == 1)
        MEM_BlockHeaderCheck(FreeBlockHdr->next_free);
#endif
        FreeBlockHdr = FreeBlockHdr->next_free;
        /* avoid looping */
        assert(FreeBlockHdr != FreeBlockHdr->next_free);
    } while (true);
    /* MEM_DBG_LOG("BlockHdrFound: %x", BlockHdrFound); */

#ifdef MEM_DEBUG_OUT_OF_MEMORY
    assert(BlockHdrFound);
#endif

#ifdef MEM_MANAGER_BENCH
    STOP_TIME  = TM_GetTimestamp();
    ALLOC_TIME = STOP_TIME - START_TIME;
#endif /* MEM_MANAGER_BENCH */

    if (BlockHdrFound != NULL)
    {
        void_ptr_t buffer_ptr;
#ifdef MEM_TRACKING
        void_ptr_t lr;
        lr.raw_address                    = (uint32_t)__mem_get_LR();
        BlockHdrFound->first_alloc_caller = lr.void_ptr;
#endif
        buffer_ptr.raw_address = (uint32_t)BlockHdrFound + BLOCK_HDR_SIZE;
        buffer                 = buffer_ptr.void_ptr;
    }
    else
    {
        /* TODO: Allocation failure try to merge free blocks together  */
    }
#ifdef MEM_STATISTICS_INTERNAL
#ifdef MEM_MANAGER_BENCH
    MEM_BufferAllocates_memStatis(buffer, ALLOC_TIME, numBytes);
#else
    MEM_BufferAllocates_memStatis(buffer, 0, numBytes);
#endif

    if ((p_area->ctx.statistics.nb_alloc % NB_ALLOC_REPORT_THRESHOLD) == 0U)
    {
        MEM_Reports_memStatis();
    }
#endif /* MEM_STATISTICS_INTERNAL */

    /*
     * The workaround for IAR optimization issue. And code block might get removed after the optimization issue is fixed
     * by IAR.
     */

    ENABLE_GLOBAL_IRQ(regPrimask);

    return buffer;
}

static void *MEM_BufferAllocate(uint32_t numBytes, uint8_t poolId)
{
    memAreaPrivDesc_t *p_area;
    void *buffer    = NULL;
    uint8_t area_id = 0U;

    if (initialized == false)
    {
        MEM_Init();
    }
    if (poolId == 0U)
    {
        area_id = 0U;
        for (p_area = &heap_area_list; p_area != NULL; p_area = (memAreaPrivDesc_t *)p_area->next)
        {
            if ((p_area->flags & AREA_FLAGS_POOL_NOT_SHARED) == 0U)
            {
                buffer = MEM_BufferAllocateFromArea(p_area, area_id, numBytes);
                if (buffer != NULL)
                {
                    break;
                }
            }
            area_id++;
        }
    }
    else
    {
        p_area = MEM_GetAreaByAreaId(poolId); /* Exclusively allocate from targeted pool */
        if (p_area != NULL)
        {
            buffer = MEM_BufferAllocateFromArea(p_area, poolId, numBytes);
        }
    }
    return buffer;
}

void *MEM_BufferAllocWithId(uint32_t numBytes, uint8_t poolId)
{
#ifdef MEM_TRACKING
    void_ptr_t BlockHdr_ptr;
#endif
    void_ptr_t buffer_ptr;

#if defined(gFSCI_MemAllocTest_Enabled_d) && (gFSCI_MemAllocTest_Enabled_d)
    void *pCaller = (void *)((uint32_t *)__mem_get_LR());
    /* Verify if the caller is part of any FSCI memory allocation test. If so, return NULL. */
    if (FSCI_MemAllocTestCanAllocate(pCaller) == kStatus_AllocBlock)
    {
        buffer_ptr.void_ptr = NULL;
        return buffer_ptr.void_ptr;
    }
#endif

    /* Alloc a buffer */
    buffer_ptr.void_ptr = MEM_BufferAllocate(numBytes, poolId);

#ifdef MEM_TRACKING
    if (buffer_ptr.void_ptr != NULL)
    {
        BlockHdr_ptr.raw_address = buffer_ptr.raw_address - BLOCK_HDR_SIZE;
        /* store caller */
        BlockHdr_ptr.block_hdr_ptr->second_alloc_caller = (void *)((uint32_t *)__mem_get_LR());
        ;
    }
#endif

    return buffer_ptr.void_ptr;
}

static mem_status_t MEM_BufferFreeBackToArea(memAreaPrivDesc_t *p_area, void *buffer)
{
    void_ptr_t buffer_ptr;
    buffer_ptr.void_ptr = buffer;
    blockHeader_t *BlockHdr;
    BlockHdr = (blockHeader_t *)(buffer_ptr.raw_address - BLOCK_HDR_SIZE);

    mem_status_t ret = kStatus_MemSuccess;
    /* when allocating a buffer, we always create a FreeBlockHdr at
       the end of the buffer, so the FreeBlockHdrList.tail should always
       be at a higher address than current BlockHdr */
    assert(BlockHdr < p_area->ctx.FreeBlockHdrList.tail);

#if defined(gMemManagerLightGuardsCheckEnable) && (gMemManagerLightGuardsCheckEnable == 1)
    MEM_BlockHeaderCheck(BlockHdr->next);
#endif

    /* MEM_DBG_LOG("%x %d", BlockHdr, BlockHdr->buff_size); */

#if defined(MEM_STATISTICS_INTERNAL)
    MEM_BufferFrees_memStatis(buffer);
#endif /* MEM_STATISTICS_INTERNAL */

    if (BlockHdr < p_area->ctx.FreeBlockHdrList.head)
    {
        /* BlockHdr is placed before FreeBlockHdrList.head so we can set it as
           the new head of the list */
        BlockHdr->next_free                          = p_area->ctx.FreeBlockHdrList.head;
        BlockHdr->prev_free                          = NULL;
        p_area->ctx.FreeBlockHdrList.head->prev_free = BlockHdr;
        p_area->ctx.FreeBlockHdrList.head            = BlockHdr;
    }
    else
    {
        /* we want to find the previous free block header
           here, we cannot use prev_free as this information could be outdated
           so we need to run through the whole list to be sure to catch the
           correct previous free block header */
        blockHeader_t *PrevFreeBlockHdr = p_area->ctx.FreeBlockHdrList.head;
        while ((uint32_t)PrevFreeBlockHdr->next_free < (uint32_t)BlockHdr)
        {
            PrevFreeBlockHdr = PrevFreeBlockHdr->next_free;
        }
        /* insert the new free block in the list */
        BlockHdr->next_free            = PrevFreeBlockHdr->next_free;
        BlockHdr->prev_free            = PrevFreeBlockHdr;
        BlockHdr->next_free->prev_free = BlockHdr;
        PrevFreeBlockHdr->next_free    = BlockHdr;
    }

