benjaminkravets/KW45B41Z/kw45b41zevk_beacon_bm/component/mem_manager/fsl_component_mem_manager_light.c
    BlockHdr->used = MEMMANAGER_BLOCK_FREE;
#if defined(MEM_STATISTICS_INTERNAL)
    BlockHdr->buff_size = 0U;
#endif

#if defined(gMemManagerLightFreeBlocksCleanUp) && (gMemManagerLightFreeBlocksCleanUp != 0)
    MEM_BufferFreeBlocksCleanUp(p_area, BlockHdr);
#endif
    return ret;
}

mem_status_t MEM_BufferFree(void *buffer /* IN: Block of memory to free*/)
{
    mem_status_t ret = kStatus_MemSuccess;
    void_ptr_t buffer_ptr;
    buffer_ptr.void_ptr = buffer;

    if (buffer == NULL)
    {
        ret = kStatus_MemFreeError;
    }
    else
    {
        uint32_t regPrimask = DisableGlobalIRQ();

        blockHeader_t *BlockHdr;
        BlockHdr = (blockHeader_t *)(buffer_ptr.raw_address - BLOCK_HDR_SIZE);

        /* assert checks */
        assert(BlockHdr->used == MEMMANAGER_BLOCK_USED);
        assert(BlockHdr->next != NULL);
        memAreaPrivDesc_t *p_area = MEM_GetAreaByAreaId(BlockHdr->area_id);

        if (p_area != NULL)
        {
            ret = MEM_BufferFreeBackToArea(p_area, buffer);
        }
        else
        {
            assert(p_area != NULL);
            ret = kStatus_MemFreeError;
        }

        ENABLE_GLOBAL_IRQ(regPrimask);
    }

    return ret;
}

mem_status_t MEM_BufferFreeAllWithId(uint8_t poolId)
{
    mem_status_t status = kStatus_MemSuccess;
#if (defined(MEM_TRACK_ALLOC_SOURCE) && (MEM_TRACK_ALLOC_SOURCE == 1))
#ifdef MEMMANAGER_NOT_IMPLEMENTED_YET

#endif /* MEMMANAGER_NOT_IMPLEMENTED_YET */
#else  /* (defined(MEM_TRACK_ALLOC_SOURCE) && (MEM_TRACK_ALLOC_SOURCE == 1)) */
    status = kStatus_MemFreeError;
#endif /* (defined(MEM_TRACK_ALLOC_SOURCE) && (MEM_TRACK_ALLOC_SOURCE == 1)) */
    return status;
}

uint32_t MEM_GetHeapUpperLimitByAreaId(uint8_t area_id)
{
    /* There is always a free block at the end of the heap
        and this free block is the tail of the list */
    uint32_t upper_limit = 0U;
    do
    {
        memAreaPrivDesc_t *p_area;
        p_area = MEM_GetAreaByAreaId(area_id);
        if (p_area == NULL)
        {
            break;
        }
        upper_limit = ((uint32_t)p_area->ctx.FreeBlockHdrList.tail + BLOCK_HDR_SIZE);

    } while (false);

    return upper_limit;
}

uint32_t MEM_GetHeapUpperLimit(void)
{
    return MEM_GetHeapUpperLimitByAreaId(0u);
}

uint32_t MEM_GetFreeHeapSizeLowWaterMarkByAreaId(uint8_t area_id)
{
    uint32_t low_watermark = 0U;
    do
    {
        memAreaPrivDesc_t *p_area;
        p_area = MEM_GetAreaByAreaId(area_id);
        if (p_area == NULL)
        {
            break;
        }
        low_watermark = p_area->low_watermark;

    } while (false);
    return low_watermark;
}

uint32_t MEM_GetFreeHeapSizeLowWaterMark(void)
{
    return MEM_GetFreeHeapSizeLowWaterMarkByAreaId(0u);
}

uint32_t MEM_ResetFreeHeapSizeLowWaterMarkByAreaId(uint8_t area_id)
{
    uint32_t current_level = 0U;
    do
    {
        memAreaPrivDesc_t *p_area;
        blockHeader_t *FreeBlockHdr;
        uint32_t current_footprint;
        p_area = MEM_GetAreaByAreaId(area_id);
        if (p_area == NULL)
        {
            break;
        }
        FreeBlockHdr      = p_area->ctx.FreeBlockHdrList.head;
        current_footprint = (uint32_t)FreeBlockHdr + BLOCK_HDR_SIZE - 1U;

        /* Current allocation should never be greater than heap end */
        current_level         = p_area->end_address.raw_address - current_footprint;
        p_area->low_watermark = current_level;

    } while (false);
    return current_level;
}

uint32_t MEM_ResetFreeHeapSizeLowWaterMark(void)
{
    return MEM_ResetFreeHeapSizeLowWaterMarkByAreaId(0u);
}

uint16_t MEM_BufferGetSize(void *buffer)
{
    blockHeader_t *BlockHdr = NULL;
    uint16_t size;
    /* union used to fix Misra */
    void_ptr_t buffer_ptr;
    buffer_ptr.void_ptr = buffer;

    if (buffer != NULL)
    {
        BlockHdr = (blockHeader_t *)(buffer_ptr.raw_address - BLOCK_HDR_SIZE);
        /* block size is the space between current BlockHdr and next BlockHdr */
        size = (uint16_t)((uint32_t)BlockHdr->next - (uint32_t)BlockHdr - BLOCK_HDR_SIZE);
    }
    else
    {
        /* is case of a NULL buffer, we return 0U */
        size = 0U;
    }

    return size;
}

void *MEM_BufferRealloc(void *buffer, uint32_t new_size)
{
    void *realloc_buffer = NULL;
    uint16_t block_size  = 0U;
    do
    {
        if (new_size >= MAX_UINT16)
        {
            realloc_buffer = NULL;
            /* Bypass he whole procedure so keep original buffer that cannot be reallocated */
            break;
        }
        if (new_size == 0U)
        {
            /* new requested size is 0, free old buffer */
            (void)MEM_BufferFree(buffer);
            realloc_buffer = NULL;
            break;
        }
        if (buffer == NULL)
        {
            /* input buffer is NULL simply allocate a new buffer and return it */
            realloc_buffer = MEM_BufferAllocate(new_size, 0U);
            break;
        }
        /* Current buffer needs to be reallocated */
        block_size = MEM_BufferGetSize(buffer);

        if ((uint16_t)new_size <= block_size)
        {
            /* current buffer is large enough for the new requested size
               we can still use it */
            realloc_buffer = buffer;
        }
        else
        {
            /* not enough space in the current block, creating a new one */
            realloc_buffer = MEM_BufferAllocate(new_size, 0U);

            if (realloc_buffer != NULL)
            {
                /* copy input buffer data to new buffer */
                (void)memcpy(realloc_buffer, buffer, (uint32_t)block_size);

                /* free old buffer */
                (void)MEM_BufferFree(buffer);
            }
        }
    } while (false);
    return realloc_buffer;
}
static uint32_t MEM_GetFreeHeapSpaceInArea(memAreaPrivDesc_t *p_area)
{
    uint32_t free_sz = 0U;
    /* skip unshared areas  */
    blockHeader_t *freeBlockHdr = p_area->ctx.FreeBlockHdrList.head;

    /* Count every free block in the free space */
    while (freeBlockHdr != p_area->ctx.FreeBlockHdrList.tail)
    {
        free_sz += ((uint32_t)freeBlockHdr->next - (uint32_t)freeBlockHdr - BLOCK_HDR_SIZE);
        freeBlockHdr = freeBlockHdr->next_free;
    }

    /* Add remaining free space in the heap */
    free_sz += p_area->end_address.raw_address - (uint32_t)p_area->ctx.FreeBlockHdrList.tail - BLOCK_HDR_SIZE + 1;
    return free_sz;
}

uint32_t MEM_GetFreeHeapSizeByAreaId(uint8_t area_id)
{
    memAreaPrivDesc_t *p_area;
    uint32_t free_size = 0U;

    if (area_id == 0U)
    {
        /* Iterate through all registered areas */
        for (p_area = &heap_area_list; p_area != NULL; p_area = (memAreaPrivDesc_t *)p_area->next)
        {
            if ((p_area->flags & AREA_FLAGS_POOL_NOT_SHARED) == 0U)
            {
                free_size += MEM_GetFreeHeapSpaceInArea(p_area);
            }
        }
    }
    else
    {
        p_area = MEM_GetAreaByAreaId(area_id);
        if (p_area != NULL)
        {
            free_size = MEM_GetFreeHeapSpaceInArea(p_area);
        }
    }
    return free_size;
}

uint32_t MEM_GetFreeHeapSize(void)
{
    return MEM_GetFreeHeapSizeByAreaId(0U);
}

__attribute__((weak)) void MEM_ReinitRamBank(uint32_t startAddress, uint32_t endAddress)
{
    /* To be implemented by the platform */
    (void)startAddress;
    (void)endAddress;
}

#if 0 /* MISRA C-2012 Rule 8.4 */
uint32_t MEM_GetAvailableBlocks(uint32_t size)
{
    /* Function not implemented yet */
    assert(0);

    return 0U;
}
#endif

void *MEM_CallocAlt(size_t len, size_t val)
{
    size_t blk_size;

    blk_size = len * val;

    void *pData = MEM_BufferAllocate(blk_size, 0U);
    if (NULL != pData)
    {
        (void)memset(pData, 0U, blk_size);
    }

    return pData;
}

#if 0 /* MISRA C-2012 Rule 8.4 */
void MEM_FreeAlt(void *pData)
{
    /* Function not implemented yet */
    assert(0);
}
#endif

#endif
